templates/openfoam/3.0.1/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     3.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1.0;

vertices
(
    (0         0           0      )
    ($[domain.lx]   0           0      )
    ($[domain.lx]   $[domain.ly]    0      )
    (0         $[domain.ly]    0      )
    (0         0           $[domain.lz])
    ($[domain.lx]   0           $[domain.lz])
    ($[domain.lx]   $[domain.ly]    $[domain.lz])
    (0         $[domain.ly]    $[domain.lz])
);

blocks
(
    hex (0 1 2 3 4 5 6 7) ($[mesh.ncx] $[mesh.ncy] $[mesh.ncz]) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    movingWall
    {
        type wall;
        faces
        (
            (3 7 6 2)
        );
    }
    CPLReceiveMD
    {
        type patch;
        faces
        (
            (1 5 4 0)
        );
    }
    streamwiseIn
    {
        type cyclic;
        neighbourPatch streamwiseOut;
        faces
        (
            (0 4 7 3)
        );
    }
    streamwiseOut
    {
        type cyclic;
        neighbourPatch streamwiseIn;
        faces
        (
            (2 6 5 1)
        );
    }
    front
    {
        type cyclic;
        neighbourPatch back;
        faces
        (
            (0 3 2 1)
        );
    }
    back
    {
        type cyclic;
        neighbourPatch front;
        faces
        (
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
